experiments/throughput_for_writes/logs/20181113170159/ratio1:0_run3_vclients32_workerthreads64_client3_instance1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      158409 ops,    2284 (avg:    2262) ops/sec, 9.00MB/sec (avg: 8.92MB/sec), 13.95 (avg: 14.14) msec latency

1         Threads
32        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        2262.62          ---          ---     14.13900      9131.98 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      2262.62         0.00         0.00     14.13900      9131.98 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.200         0.00
SET       1.400         0.00
SET       1.500         0.01
SET       1.600         0.01
SET       1.700         0.02
SET       1.800         0.02
SET       1.900         0.03
SET       2.000         0.04
SET       2.100         0.05
SET       2.200         0.06
SET       2.300         0.08
SET       2.400         0.10
SET       2.500         0.12
SET       2.600         0.14
SET       2.700         0.15
SET       2.800         0.18
SET       2.900         0.21
SET       3.000         0.24
SET       3.100         0.27
SET       3.200         0.30
SET       3.300         0.34
SET       3.400         0.39
SET       3.500         0.43
SET       3.600         0.47
SET       3.700         0.52
SET       3.800         0.56
SET       3.900         0.60
SET       4.000         0.66
SET       4.100         0.71
SET       4.200         0.77
SET       4.300         0.82
SET       4.400         0.88
SET       4.500         0.94
SET       4.600         1.01
SET       4.700         1.07
SET       4.800         1.16
SET       4.900         1.25
SET       5.000         1.34
SET       5.100         1.42
SET       5.200         1.49
SET       5.300         1.58
SET       5.400         1.67
SET       5.500         1.78
SET       5.600         1.90
SET       5.700         2.02
SET       5.800         2.15
SET       5.900         2.27
SET       6.000         2.41
SET       6.100         2.57
SET       6.200         2.71
SET       6.300         2.86
SET       6.400         3.02
SET       6.500         3.19
SET       6.600         3.35
SET       6.700         3.53
SET       6.800         3.71
SET       6.900         3.92
SET       7.000         4.15
SET       7.100         4.35
SET       7.200         4.61
SET       7.300         4.86
SET       7.400         5.12
SET       7.500         5.39
SET       7.600         5.69
SET       7.700         6.03
SET       7.800         6.34
SET       7.900         6.67
SET       8.000         7.03
SET       8.100         7.41
SET       8.200         7.79
SET       8.300         8.18
SET       8.400         8.61
SET       8.500         9.06
SET       8.600         9.60
SET       8.700        10.09
SET       8.800        10.60
SET       8.900        11.18
SET       9.000        11.79
SET       9.100        12.48
SET       9.200        13.22
SET       9.300        14.00
SET       9.400        14.79
SET       9.500        15.65
SET       9.600        16.63
SET       9.700        17.56
SET       9.800        18.66
SET       9.900        19.76
SET      10.000        25.69
SET      11.000        35.70
SET      12.000        45.16
SET      13.000        53.87
SET      14.000        61.70
SET      15.000        68.55
SET      16.000        74.62
SET      17.000        79.67
SET      18.000        83.73
SET      19.000        87.02
SET      20.000        89.78
SET      21.000        91.75
SET      22.000        93.36
SET      23.000        94.61
SET      24.000        95.60
SET      25.000        96.40
SET      26.000        97.02
SET      27.000        97.56
SET      28.000        97.94
SET      29.000        98.23
SET      30.000        98.48
SET      31.000        98.66
SET      32.000        98.82
SET      33.000        98.95
SET      34.000        99.08
SET      35.000        99.19
SET      36.000        99.29
SET      37.000        99.37
SET      38.000        99.44
SET      39.000        99.51
SET      40.000        99.57
SET      41.000        99.61
SET      42.000        99.65
SET      43.000        99.68
SET      44.000        99.71
SET      45.000        99.73
SET      46.000        99.75
SET      47.000        99.78
SET      48.000        99.79
SET      49.000        99.81
SET      50.000        99.82
SET      51.000        99.84
SET      52.000        99.85
SET      53.000        99.87
SET      54.000        99.88
SET      55.000        99.89
SET      56.000        99.90
SET      57.000        99.91
SET      58.000        99.91
SET      59.000        99.92
SET      60.000        99.92
SET      61.000        99.93
SET      62.000        99.93
SET      63.000        99.94
SET      64.000        99.94
SET      65.000        99.95
SET      66.000        99.95
SET      69.000        99.95
SET      70.000        99.95
SET      71.000        99.95
SET      72.000        99.95
SET      73.000        99.95
SET      74.000        99.96
SET      75.000        99.96
SET      76.000        99.96
SET      77.000        99.96
SET      86.000        99.96
SET     130.000        99.98
SET     140.000        99.98
SET     180.000        99.98
SET     190.000       100.00
SET     200.000       100.00
---
---