experiments/throughput_for_writes/logs/20181113170159/ratio1:0_run3_vclients8_workerthreads64_client1_instance2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      104238 ops,    1510 (avg:    1489) ops/sec, 5.95MB/sec (avg: 5.87MB/sec),  5.30 (avg:  5.37) msec latency

1         Threads
8         Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1489.03          ---          ---      5.36900      6009.75 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1489.03         0.00         0.00      5.36900      6009.75 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.730         0.00
SET       0.760         0.00
SET       0.770         0.00
SET       0.790         0.01
SET       0.800         0.01
SET       0.810         0.02
SET       0.820         0.03
SET       0.830         0.04
SET       0.840         0.06
SET       0.850         0.08
SET       0.860         0.10
SET       0.870         0.13
SET       0.880         0.17
SET       0.890         0.21
SET       0.900         0.27
SET       0.910         0.34
SET       0.920         0.41
SET       0.930         0.51
SET       0.940         0.60
SET       0.950         0.71
SET       0.960         0.82
SET       0.970         0.95
SET       0.980         1.08
SET       0.990         1.23
SET       1.000         2.30
SET       1.100         5.15
SET       1.200         9.27
SET       1.300        14.08
SET       1.400        19.12
SET       1.500        23.70
SET       1.600        27.67
SET       1.700        30.90
SET       1.800        33.50
SET       1.900        35.60
SET       2.000        37.16
SET       2.100        38.53
SET       2.200        39.59
SET       2.300        40.45
SET       2.400        41.12
SET       2.500        41.71
SET       2.600        42.17
SET       2.700        42.57
SET       2.800        42.97
SET       2.900        43.34
SET       3.000        43.66
SET       3.100        43.95
SET       3.200        44.23
SET       3.300        44.47
SET       3.400        44.72
SET       3.500        44.93
SET       3.600        45.17
SET       3.700        45.39
SET       3.800        45.58
SET       3.900        45.80
SET       4.000        46.01
SET       4.100        46.23
SET       4.200        46.46
SET       4.300        46.65
SET       4.400        46.89
SET       4.500        47.11
SET       4.600        47.34
SET       4.700        47.56
SET       4.800        47.78
SET       4.900        47.99
SET       5.000        48.20
SET       5.100        48.44
SET       5.200        48.71
SET       5.300        48.99
SET       5.400        49.29
SET       5.500        49.60
SET       5.600        49.90
SET       5.700        50.16
SET       5.800        50.49
SET       5.900        50.83
SET       6.000        51.25
SET       6.100        51.68
SET       6.200        52.20
SET       6.300        52.79
SET       6.400        53.40
SET       6.500        54.04
SET       6.600        54.68
SET       6.700        55.42
SET       6.800        56.20
SET       6.900        57.07
SET       7.000        57.96
SET       7.100        58.92
SET       7.200        59.86
SET       7.300        60.94
SET       7.400        62.01
SET       7.500        63.21
SET       7.600        64.53
SET       7.700        66.22
SET       7.800        68.05
SET       7.900        70.03
SET       8.000        72.12
SET       8.100        74.36
SET       8.200        76.63
SET       8.300        78.87
SET       8.400        81.16
SET       8.500        83.22
SET       8.600        85.03
SET       8.700        86.63
SET       8.800        87.90
SET       8.900        88.97
SET       9.000        89.86
SET       9.100        90.55
SET       9.200        91.12
SET       9.300        91.62
SET       9.400        92.07
SET       9.500        92.44
SET       9.600        92.81
SET       9.700        93.16
SET       9.800        93.47
SET       9.900        93.79
SET      10.000        94.95
SET      11.000        96.24
SET      12.000        97.05
SET      13.000        97.70
SET      14.000        98.20
SET      15.000        98.58
SET      16.000        98.88
SET      17.000        99.26
SET      18.000        99.38
SET      19.000        99.46
SET      20.000        99.53
SET      21.000        99.56
SET      22.000        99.60
SET      23.000        99.63
SET      24.000        99.65
SET      25.000        99.67
SET      26.000        99.69
SET      27.000        99.70
SET      28.000        99.73
SET      29.000        99.74
SET      30.000        99.77
SET      31.000        99.81
SET      32.000        99.83
SET      33.000        99.85
SET      34.000        99.86
SET      35.000        99.86
SET      36.000        99.88
SET      37.000        99.89
SET      38.000        99.91
SET      39.000        99.92
SET      40.000        99.93
SET      43.000        99.93
SET      44.000        99.93
SET      45.000        99.94
SET      46.000        99.94
SET      62.000        99.94
SET      65.000        99.95
SET      68.000        99.95
SET      69.000        99.95
SET      71.000        99.95
SET      72.000        99.95
SET      73.000        99.95
SET      74.000        99.96
SET      77.000        99.96
SET      79.000        99.96
SET      82.000        99.96
SET      84.000        99.96
SET      97.000        99.96
SET      99.000        99.96
SET     100.000        99.97
SET     110.000        99.98
SET     120.000        99.98
SET     170.000        99.99
SET     180.000        99.99
SET     190.000        99.99
SET     200.000       100.00
SET     210.000       100.00
---
---